{
  "info": {
    "name": "Michael",
    "surname": "Jones Williams",
    "office": "616 E Clybourn St, Milwaukee",
    "accountNumber": "GB82 WEST 1234 5698 7654 32",
    "clientId": "24684688",
    "accounts": [
      {
        "id": 1,
        "alias": "Main",
        "wealth": 125032000,
        "operatingLimit": 27832832,
        "balance": 27832832,
        "currency": "EUR"
      },
      {
        "id": 2,
        "alias": "Familiar",
        "wealth": 32681258,
        "operatingLimit": 7832832,
        "balance": 7832832,
        "currency": "USD"
      }
    ]
  },
  "markets": {
    "list": [
      { "id": "DOW", "name": "DOW JONES", "last": 2982390, "dif": 0.63 },
      { "id": "IB35", "name": "IBEX 35", "last": 816730, "dif": 0.33 },
      { "id": "STOXX", "name": "DJ EURO STOXX 50", "last": 351651, "dif": -0.25 },
      { "id": "DAX", "name": "DAX INDEX", "last": 1333847, "dif": -0.33 },
      { "id": "CAC", "name": "CAC 40 INDEX", "last": 557059, "dif": -0.2 },
      { "id": "NASC", "name": "NASDAQ COMPOSITE", "last": 1235510, "dif": 1.28 },
      { "id": "NAS100", "name": "NASDAQ 100", "last": 1245530, "dif": 1.52 },
      { "id": "MINISP", "name": "MINI S&P 500 STOCK", "last": 365450, "dif": -0.16 },
      { "id": "MINIDOW", "name": "MINI-SIZED DOW JONES", "last": 29704, "dif": -0.34 },
      { "id": "MININAS", "name": "MINI NASDAQ 100", "last": 1244320, "dif": -0.07 }
    ],
    "updowns": [
      {
        "id": "DOW",
        "name": "DOW JONES",
        "ups": [
          { "name": "HOME DEPOT INC", "last": 27688, "dif": 0.65 },
          { "name": "TRAVELERS COS INC/THE", "last": 13357, "dif": 0.12 },
          { "name": "BOEING CO", "last": 21324, "dif": 0.11 },
          { "name": "SALESFORCE.COM INC", "last": 24161, "dif": 0.11 },
          { "name": "CATERPILLAR INC", "last": 17341, "dif": 0.09 }
        ],
        "downs": [
          { "name": "UNITEDHEALTH GROUP INC", "last": 34090, "dif": -0.08 },
          { "name": "AMERICAN EXPRESS CO", "last": 119830, "dif": -0.08 },
          { "name": "COCA COLA CO", "last": 5201, "dif": -0.06 },
          { "name": "3M CO", "last": 17045, "dif": -0.04 },
          { "name": "PROCTER AND GAMBLE CO", "last": 13932, "dif": -0.04 }
        ]
      }
    ]
  },
  "lastNews": {
    "news": [
      {
        "id": 1,
        "author": "Joe Wallace",
        "date": "2021-01-25T08:15:30Z",
        "tag": "latest",
        "img": "joe.jpg",
        "title": "10 Biden tax plans that will sail through a Democratic-controlled Senate",
        "intro": "With the New Year here and a Democratic-controlled Senate looking increasingly likely after the runoff Senate elections in Georgia, President-elect Joe Biden’s tax plans are unlikely to suffer from any lack of bipartisan support.",
        "full": "With the New Year here and a Democratic-controlled Senate looking increasingly likely after the runoff Senate elections in Georgia, President-elect Joe Biden’s tax plans are unlikely to suffer from any lack of bipartisan support. According to the Committee for a Responsible Federal Budget, an independent, non-profit, bipartisan public-policy organization based in Washington, D.C. that examines federal budget and fiscal issues, Biden’s tax plan would raise $3.35 trillion to $3.67 trillion over a decade if enacted in full starting next year, or 1.3% to 1.4% of gross domestic product. “The Biden tax plan is highly progressive, increasing taxes for the top 1% of earners by 13% to 18% of after-tax income, while indirectly increasing taxes for most other groups by 0.2% to 0.6%,” the committee said, adding, The ultimate fiscal, economic, and distributional impact of President-elect Biden’s tax policies “will depend on how newly raised revenue is spent or allocated,” it added. “Major proposals by the Biden campaign would raise $1.6 trillion to $1.9 trillion over a decade from corporations, $1 trillion to $1.2 trillion from high earners through the income tax, and $800 billion to $1 trillion from Social Security payroll taxes on high-wage earners. Biden also supports a fee on banks, which we believe will raise $100 billion, tax credits for renters and first-time homebuyers that we estimate will cost $300 billion, and an increase of the Child and Dependent Care Tax Credit, which we estimate will cost $100 billion.” While on the campaign trail, Biden told ABC News: “I will raise taxes for anybody making over $400,000. The very wealthy should pay a fair share. Corporations should pay a fair share. The fact is there are corporations making close to a trillion dollars that pay no tax at all.” He told the network that his administration would not raise taxes on “90% of the businesses out there are mom and pop businesses that employ less than 50 people.” He said the coronavirus pandemic has taken a toll on these businesses. “We have to provide them with the ability to reopen. We have to provide more help for them, not less help,” he added. With that in mind, it’s time to consider moves that will lower your 2020 tax bill, and hopefully position you for tax savings in future years too. Federal tax outlook for 2021-2022 Game the standard deduction The Tax Cuts and Jobs Act (TCJA) almost doubled the standard deduction amounts. For 2020, the basic standard deduction allowances are: * $12,400 if you are single or use married filing separate status. * $24,800 if you and your spouse file jointly. * $18,650 if you are a head of household. * Slightly higher standard deductions are allowed to those who are 65 or older or blind. Here’s the plan. If your total itemizable deductions for 2020 will be close to your standard deduction amount, consider making enough additional expenditures for itemized deduction items before year-end to exceed the standard deduction. Those prepayments will lower this year’s tax bill. Next year, your standard deduction might be a bit bigger thanks to an inflation adjustment, and you can claim it then. Or it could be smaller, if major tax-increase legislation passes, which I think is unlikely. * The easiest deductible expense to prepay is included in the house payment due on January 1. Accelerating that payment into this year will give you 13 months’ worth of itemized home mortgage interest deductions in 2020. Although the TCJA put new limits on these deductions, you’re probably unaffected. But ask your tax adviser to be sure. Next up on the prepayment menu are state and local income and property taxes that are due early next year. Prepaying those bills before year-end can decrease your 2020 federal income tax bill, because your itemized deductions total will be that much higher. However, the TCJA decreased the maximum amount you can deduct for state and local taxes to $10,000 or $5,000 if you use married filing separate status. So, beware of that limitation. Warning: The state and local tax prepayment drill can be a bad idea if you will owe the alternative minimum tax (AMT) for this year. That’s because write-offs for state and local income and property taxes are completely disallowed under the AMT rules. Therefore, prepaying those expenses may do little or no tax-saving good if you will be in the AMT zone. Thankfully, changes included in the TCJA took millions of taxpayers out of AMT danger, but not everybody. Ask your tax adviser if you’re in the clear for this year or not. * Consider making bigger charitable donations this year and smaller donations next year to compensate (more about charitable donations later). That could cause your itemized deductions to exceed your standard deduction this year. * Finally, consider accelerating elective medical procedures, dental work, and expenditures for vision care. For 2020, you can deduct medical expenses to the extent they exceed 7.5% of your adjusted gross income (AGI), assuming you itemize. Next year, the deduction threshold is scheduled to rise to 10% of AGI, but I doubt Congress will allow that to happen. Carefully manage gains and losses in taxable investment accounts If you hold investments in taxable brokerage firm accounts, consider the tax advantage of selling appreciated securities that have been held for over 12 months. The federal income tax rate on long-term capital gains recognized in 2020 is “only” 15% for most folks, although it can reach the maximum 20% rate at high income levels. The add-on 3.8% net investment income tax (NIIT) can also bite at high income levels. So, the true maximum rate for high-income individuals is 23.8%: the advertised 20% top rate plus 3.8% for the unadvertised NIIT. To the extent you have capital losses this year or capital loss carryovers from earlier years, selling winners by year-end will not result in any tax hit. In particular, sheltering net short-term capital gains with capital losses is a tax-smart move because net short-terms gains will otherwise be taxed at your higher ordinary income rate of up to 37%, plus another 3.8% if the NIIT bites. Ouch. What if you have some loser investments that you would like to unload? Biting the bullet and taking the resulting capital losses this year would shelter capital gains, including high-taxed short-term gains, from other sales this year. If selling some losers would cause your 2020 capital losses to exceed your 2020 capital gains, the result would be a net capital loss for the year. No problem. That net capital loss can be used to shelter up to $3,000 of 2020 income from salaries, bonuses, self-employment income, interest income, royalties, and whatever else ($1,500 if you use married filing separate status). Any excess net capital loss is carried forward to next year and beyond. In fact, having a capital loss carryover could turn out to be a pretty good deal. The carryover can be used to shelter both short-term gains and long-term gains recognized next year and beyond. This can give you extra investing flexibility in those years, because you won’t have to hold appreciated securities for over a year to get a lower tax rate. You’ll pay 0% to the extent you can shelter gains with your loss carryover. If there are future tax rate increases (which I think are unlikely through at least 2022), capital loss carryovers into future years could turn out to be really valuable. President-elect Biden’s major tax proposals 1. Higher maximum rate The pre-election Biden tax plan would raise the top individual federal income rate on ordinary income and net short-term capital gains back to 39.6%, the top rate that was in effect before the Tax Cuts and Jobs Act (TCJA) lowered it to 37% for 2018-2025. Biden also said he would generally raise taxes on folks with incomes above $400,000 without supplying specifics. 2. Itemized deductions Biden has said he would limit the tax benefit of itemized deductions to 28% for upper-income individuals. In other words, each dollar of allowable itemized deductions could not lower your federal income tax bill by more than 28 cents, even if you are in the proposed 39.6% maximum tax bracket. For upper-income individuals, Biden would reinstate the pre-TCJA rule that reduces total allowable itemized deductions above the applicable income threshold. Allowable deductions are reduced by 3 cents for every dollar of income above the threshold. Biden would eliminate the TCJA’s $10,000 cap on itemized deductions for state and local taxes. 3. Higher maximum rate on long-term capital gains Upper-income individuals would face higher capital gains taxes under the Biden plan. Under current law, the maximum effective federal income tax rate on net long-term capital gains and qualified dividends recognized by individual taxpayers is 23.8%, as explained in the main body of this column. Under the Biden plan, net long-term gains (and presumably dividends) collected by those with incomes above $1 million would be taxed at the same 39.6% maximum rate that is proposed for ordinary income and net short-term capital gains. With the 3.8% NIIT add-on, the maximum effective rate on net long-term gains would 43.4% (39.6% plus 3.8%). That would be almost double the current maximum effective rate of “only” 23.8%. 4. Higher Social Security taxes for upper-income individuals Under current law, the 12.4% Social Security tax hits the first $137,700 of 2020 wages or net self-employment income. Employees pay 6.2% via withholding from paychecks, and employers pay the remaining 6.2%. Self-employed individuals pay the entire 12.4% out of their own pockets via the self-employment (SE) tax. For 2020, the 12.4% Social Security tax cuts out once 2020 wages or net SE income exceed the $137,700 ceiling. For 2021 and beyond, the Social Security tax ceiling will be adjusted annually to account for inflation. As things currently stand, the 2021 ceiling will rise to $142,800. The Biden tax plan would restart the 12.4% Social Security tax on wages and net SE income above $400,000. This is the so-called donut hole approach to increasing the Social Security tax. Over the years, the donut hole would gradually close as the lower edge of the hole is adjusted upward for inflation while the $400,000 upper edge of the hole remains static. 5. Elimination of basis step-up for inherited assets Under current law, the federal income tax basis of an inherited capital-gain asset is stepped up fair market value as of the decedent’s date of death. So, if heirs sell inherited capital-gain assets, they only owe federal capital gains tax on the post-death appreciation, if any. This provision can be a huge tax-saver for greatly-appreciated inherited assets — such as personal residences that were acquired many years ago for next to nothing and are now worth millions. The Biden plan would eliminate this tax-saving provision. 6. Elimination of real-estate tax breaks The Biden tax plan would: (1) eliminate the $25,000 exemption from the passive loss rules for rental real estate losses incurred by middle-income individuals, (2) eliminate Section 1031 like-kind exchanges that allow deferral of capital gains taxes on swaps of appreciated real property, (3) eliminate rules that allow faster depreciation write-offs for certain real property, and (4) eliminate qualified business income (QBI) deductions for profitable rental real estate activities. 7. Increased child- and dependent-care credits Under current law, parents can collect a credit of up to $2,000 for each under-age-13 qualifying child. This is a refundable credit, which means you don’t have to have any federal income tax liability to collect the credit. In other words, the child credit is “free money.” Under current law, another credit of up to $2,100 is allowed to cover expenses to care for a qualifying dependent, including an eligible child, or up to $4,200 for expenses to care for two or more qualifying dependents. In most cases, however, an income limitation reduces the maximum allowable credit to $1,200 or $2,400 for two or more qualifying dependents. The Biden tax plan would increase the maximum refundable child credit to $4,000 for one qualifying child or $8,000 for two or more qualifying children. Families making between $125,000 and $400,000 would receive reduced credits. Apparently, the same rules would apply to an enhanced credit for expenses to care for qualifying dependents. Biden would also establish a new credit of up to $5,000 for informal caregivers. 8. New credits for homebuyers and renters The Biden plan would create a new refundable tax credit of up to $15,000 for eligible first-time homebuyers. The credit could be collected when a home is purchased, rather than later at tax-return filing time. Biden would also establish a new refundable tax credit for low-income renters. The credit would be intended to hold rent and utility payments to 30% of monthly income. 9. ‘Green energy’ tax changes Biden would reinstate or expand tax incentives intended to reduce carbon emissions — such as deductions for emission-reducing investments in residential and commercial buildings and restored credits for buying electric vehicles produced by manufacturers whose credits have been phased-out under current law. Biden would also eliminate federal income tax deductions for oil and gas drilling costs and depletion. 10. And finally… One of the biggest changes in the 2017 Tax Cuts and Jobs Act (TCJA) was the installation of a flat 21% corporate federal income tax rate for 2018 and beyond. Before the TCJA, the maximum effective rate for profitable corporations was 35%. The Biden plan would increase the corporate tax rate to 28%. This change would raise an estimated $1.1 trillion or so over 10 years. The Biden plan would impose a new 15% minimum tax on corporations with at least $100 million in annual income that pay little or no federal income tax under the “regular rules.” An affected corporation would pay the greater of: (1) the “regular” federal income tax bill or (2) 15% of reported book net income. This new tax would raise an estimated $160 billion to $320 billion over 10 years.  "
      },
      {
        "id": 2,
        "author": "James Mackintosh",
        "date": "2021-01-20T09:20:30Z",
        "tag": "markets",
        "img": "james.jpg",
        "title": "Asian markets track Wall Street’s rally on hopes for stimulus",
        "intro": "Shares rose in Asia on Thursday after Wall Street rallied on expectations of more stimulus for the economy, despite chaotic scenes in Washington as Trump supporters stormed the U.S. Capitol.",
        "full": "Shares rose in Asia on Thursday after Wall Street rallied on expectations of more stimulus for the economy, despite chaotic scenes in Washington as Trump supporters stormed the U.S. Capitol. As Congress reconvened after disruptions to the process for recognizing the outcome of the U.S. presidential election, U.S. futures also were higher, with the contract for the S&P 500 ES00, 0.47% up 0.6%. Futures for the Dow industrials YM00, 0.31% gained 0.4%. Investors expect that Democratic control of both houses of congress, after Democrats won two runoff senatorial elections in Georgia has raised the potential for increased spending on infrastructure and other areas under President-elect Joe Biden’s administration. With pandemic restrictions being reinstated in many places as coronavirus caseloads rise, economists and investors have been hoping for more economic aid for Americans and businesses. A strong U.S. economy is needed to help drive a global recovery from the worst downturn in decades. “Asia markets are going into Thursday with the positive sentiment being the de facto mood and shrugging off the domestic violence that had been seen in the U.S.,” Jingyi Pan of IG said in a commentary. Hong Kong’s Hang Seng index HSI, -0.52% sank 0.1% while the Nikkei 225 NIK, +1.60% index in Tokyo gained 1.8%. The Shanghai Composite SHCOMP, +0.71% inched higher while the smaller-cap Shenzhen Composite 399106, +0.21% retreated. South Korea’s Kospi 180721, +2.14% climbed 2.4% and the S&P/ASX 200 XJO, +1.59% in Australia advanced 1.6%. Stocks fell in Malaysia FBMKLCI, +0.69% but rose in Singapore STI, +1.54%, Taiwan Y9999, +1.54% and Indonesia JAKIDX, +1.45%. Overnight, the S&P 500 SPX, +0.57% rose 0.6% to 3,748.14. The Dow DJIA, +1.44% gained 1.4%, to 30,829.40, a record high. Investors piled into stocks of smaller companies, banks and other businesses that would be winners if Democrats push through more economic support for the economy. The Russell 2000 index RUT, +3.98% of small-cap stocks surged 4%, to 2,057.92, a record high. Another round of stimulus for the economy could benefit smaller companies in particular because they tend to have smaller financial cushions to survive long-term downturns. The rally lost some momentum Wednesday afternoon after the U.S. Capitol building went into lockdown as supporters of President Donald Trump broke through barricades and entered the building following clashes with police. Both houses of Congress abruptly went into recess, interrupting debate over the Electoral College vote that gave Joe Biden the presidency. Earlier, Trump riled up the crowd with his baseless claims of election fraud. Traders largely looked past the unrest that erupted in Washington and chose to look ahead to later this year, when they expect the prospects for the economy to brighten. hey think it’s a temporary issue that will ultimately be resolved.” The Nasdaq composite COMP, -0.61%, which is full of tech stocks, shed early gains as investors shifted from the winners of the stay-at-home economy of the pandemic toward companies whose profits would benefit most from a healthier economy. The index fell 0.6% to 12,740.79. “This is just a market taking into account the likely outcomes from what happened in the election,” said Andrew Mies, chief investment officer at investment advisory firm 6 Meridien. “You have the recognition that the Democratic agenda is probably much more mainstream than people feared.” A report on Wednesday underscored how fragile the U.S. economy is because of the worsening pandemic. Payroll processor ADP said private employers cut 123,000 more jobs last month than they added. It was much worse than economists’ expectations for job growth, and it was the weakest such report since April. The Labor Department’s more comprehensive report on jobs growth is due on Friday. Big spending plans for the economy could trigger not only stronger growth for the economy in the future but also heavier borrowing by the U.S. government and maybe even inflation. Those factors helped push up Treasury yields, and the yield on the 10-year Treasury ticket up to 1.05% from 1.04% late Wednesday, having surpassed 1% for the first time since March. Democratic control of Washington could also lead to higher tax rates for businesses, which would crimp profits and add downward pressure on stocks broadly. But analysts say that given how slim the Democratic majority may be scope for major change is limited. The party will have a 50-50 split in the Senate with Democratic Vice President-elect Kamala Harris providing a tie-breaking vote. “Investors that have concerns today should probably check some of those concerns,” Levitt said. “The first year of this administration is going to be about providing as much support as possible to an economic recovery.” In other trading, U.S. benchmark crude oil CLG21, 0.57% gained 29 cents to $50.92 per barrel in electronic trading on the New York Mercantile Exchange. It rose 70 cents to $50.63 per barrel on Wednesday. Brent crude BRNH21, 0.20% gained 25 cents to $54.55 per barrel. The U.S. dollar USDJPY, 0.57% rose to 103.08 Japanese yen from 103.01 yen on Wednesday."
      },
      {
        "id": 3,
        "author": "Joanne Chiu",
        "date": "2021-01-19T10:10:30Z",
        "tag": "opinion",
        "img": "joanne.jpg",
        "title": "These 7 financial resolutions can boost your wealth for a lifetime",
        "intro": "This got me to thinking: If these lists are so effective, why do we need a fresh set of them every year? Two answers come immediately to mind.",
        "full": "Every year at this time, the financial media is filled with lists of how to be a better investor. This got me to thinking: If these lists are so effective, why do we need a fresh set of them every year? Two answers come immediately to mind. First, investors are fickle and easily dissuaded by their emotions, compelling sales pitches and of course the ups and downs of the markets. Second, many of the items on these lists are vague and fail to tell people what they should actually do. Ignoring that first problem, at least for now, I’m going to propose seven steps you can take that will actually make a difference. First, let’s look at a few common “rules” that aren’t really useful. Starting with Warren Buffett, who is widely regarded as the best of the best investors of our era, we find this well-known prescription: “Rule No. 1: Don’t lose money. Rule No. 2: Don’t forget Rule No. 1.” Sounds good, don’t you think? But as a New Year’s resolution, what does it mean? Unless your luck is incredibly good, any stock or fund you buy is very likely to decrease in value at some point. If you buy something for $50 a share and five minutes later its price is $49.75, have you violated this rule? Well no. If Buffett’s advice really meant that, you could never buy anything. So he must be saying you should never sell an investment at a loss. In other words, hang on forever to anything that is worth less than what you paid for it. Does that sound like a recipe for success? Buffett himself has been known to sell investments at a loss. Therefore, I have to give this “rule” for successful investing a grade of “D.” Yes, it’s thought-provoking, but it’s not helpful. I looked at a list of “10 Key Rules of Investing” from John Bogle. Many of them are good, but they fall short of being actionable instructions that tell you what to do. For example: “Don’t fight the last war. What worked in the past is no predictor of what will work in the future.” OK, but how is this useful? You can’t know what will work in the future, so you’re left to pilot a ship without a rudder. Fortunately, Bogle’s list includes this: “Stay the course. The secret to successful investing isn’t forecasting or stock picking. It is about making a plan, sticking to it, eliminating unnecessary risks, and keeping your costs low.” That’s very good, but the key thing point is “making a plan.” What should be in that plan? Will any old plan do the job? Let’s turn to Bob Farrell, who was Merrill Lynch chief market analyst and senior investment adviser for 45 years. His widely circulated rules for investors contain good insights — but they don’t tell investors what they should do. Three examples: • Excesses in one direction will lead to an opposite excess in the other direction. • When all the experts and forecasts agree — something else is going to happen. • The public buys the most at the top and the least at the bottom. Still, if you are like most investors, probably 90%, what you really want to know is exactly what to do. Instructions, in other words. You can always get instructions and recommendations from any broker. But what you really want are recommendations that will accomplish your goals, not Wall Street’s goals. If your goals include higher long-term returns, less risk, and more peace of mind, you’re in the right place. 1. Save some of your money regularly instead of spending everything. Start your serious savings earlier instead of later. If you can’t sock away a lot, don’t let that stop you. If you can save (and invest) even $25 a week, that’s still $1,300 in a year, $13,000 in 10 years. Do that for 30 years and earn a compound return of 10%, and you’ll have about $214,000. (And once you start seeing the results, I’m willing to bet you’ll find ways to add more than just $25 a week.) 2. Invest in stocks by the hundreds or thousands through low-cost index funds or ETFs in a variety of asset classes. Make sure to include value stocks and small-cap stocks. Massive diversification will reduce your risks. Indexing will almost certainly improve your return as opposed to active management. Including value stocks and small-cap stocks is highly likely to improve your long-term return. 3. Pay attention to taxes. Invest in a 401(k) or similar retirement account if one is available to you — with luck, you could even get matching funds from your employer. Maximize your use of IRA accounts, and choose a Roth IRA for its long-term tax advantages. 4. Ignore what you feel, and put your investments on automatic, using dollar-cost averaging. Don’t let greed or fear determine when you invest. Recall Bob Farrell: “The public buys the most at the top and the least at the bottom.” 5. If you’re saving in an employee plan like a 401(k), make a target date retirement plan the backbone of your allocations. In one simple step, that will accomplish most of the things you should be doing. To increase your long-term return from this fund, allocate part of every contribution you make to an auxiliary fund such as a value fund, a small-cap blend fund, or a small-cap value fund. 6. Loop back to something John Bogle and many others have recommended: Stay the course. Don’t panic and don’t try to time the market. 7. Once you have done those six things, focus on living your life instead of obsessing about your investments. Stop watching the financial news, listening to hot tips from your friends, and reading the pundits who claim (without any evidence, as they say) to know what the future holds. If you successfully and consistently do these things, I promise you’ll be among the most successful (and probably among the least stressed) investors out there. Happy New Year!"
      }
    ]
  }
}
